In [78]:
import pandas as pd

In [79]:
data=[['Yachit','male',20],['Danish','female',20],['Raj','male',21],['a','male',22],['b','female',30],['c','male',100],['d','female',10]]

In [80]:
df=pd.DataFrame(data,columns=['Name','Gender','Age'])

In [81]:
df[df['Age']<11]

  Name  Gender  Age
6    d  female   10

In [82]:
df[df['Gender']=='female']

     Name  Gender  Age
1  Danish  female   20
4       b  female   30
6       d  female   10

In [83]:
df.iloc[0:3,1:3]

   Gender  Age
0    male   20
1  female   20
2    male   21

In [84]:
df.iloc[:4,:]

     Name  Gender  Age
0  Yachit    male   20
1  Danish  female   20
2     Raj    male   21
3       a    male   22

In [85]:
df['Age'].mean()

31.857142857142858

In [86]:
print(df.groupby('Age').sum())

             Name      Gender
Age
10              d      female
20   YachitDanish  malefemale
21            Raj        male
22              a        male
30              b      female
100             c        male

In [87]:
df

     Name  Gender  Age
0  Yachit    male   20
1  Danish  female   20
2     Raj    male   21
3       a    male   22
4       b  female   30
5       c    male  100
6       d  female   10

In [88]:
df.isna().sum()

Name      0
Gender    0
Age       0
dtype: int64

In [89]:
from sklearn.preprocessing import OneHotEncoder
ohe=OneHotEncoder()

In [90]:
df1=ohe.fit_transform(df[['Gender']])

In [91]:
df1

<7x2 sparse matrix of type '<class 'numpy.float64'>'
	with 7 stored elements in Compressed Sparse Row format>

In [92]:
df1.toarray()

array([[0., 1.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.]])

In [93]:
ohe.get_feature_names_out(['Gender'])

array(['Gender_female', 'Gender_male'], dtype=object)

In [94]:
df2=pd.DataFrame(df1.toarray(),columns=ohe.get_feature_names_out(['Gender']))

In [95]:
df2

   Gender_female  Gender_male
0            0.0          1.0
1            1.0          0.0
2            0.0          1.0
3            0.0          1.0
4            1.0          0.0
5            0.0          1.0
6            1.0          0.0

In [96]:
df=pd.concat([df.drop('Gender',axis=1),df2],axis=1)

In [97]:
df

     Name  Age  Gender_female  Gender_male
0  Yachit   20            0.0          1.0
1  Danish   20            1.0          0.0
2     Raj   21            0.0          1.0
3       a   22            0.0          1.0
4       b   30            1.0          0.0
5       c  100            0.0          1.0
6       d   10            1.0          0.0